const slidesData = [
  {
    "section": "1. スプレッドシートの画面"
  },
  {
    "title": "1.1. スプレッドシートの画面",
    "note": "<p>スプレッドシートを開くと、次のような画面になります。</p>\n<p>中央の広いスペースにあるマスのことを<strong>セル</strong>といいます。また、画面の各所には操作をするための機能が配置されています。</p>",
    "image": "img_slide/ss11_03.png"
  },
  {
    "title": "1.2. アクティブセル",
    "note": "<p>現在選択しているセルのことを<strong>アクティブセル</strong>といいます。<br>\nセルにはひとつずつ番地が決まっていて、列番号（A，B，C，・・・）と行番号（1，2，3，・・・）を組み合わせて、<b>A1</b>や<b>B3</b>のように表現します。<br>\n教材中のセルは<b>【B3】</b>のように隅付き括弧を用いて表します。<br>\n次の左図では、アクティブセルの番地は<b>B3</b>です。<br>\nまた、右図では、複数のセル範囲を選択しています。その場合、「<b>【B3:C5】</b>」のように表します。\n</p>",
    "image": "img_slide/ss11_04.png"
  },
  {
    "section": "2. 文字と数字の入力"
  },
  {
    "title": "2.1. 文字の入力",
    "note": "<p>入力モードを<strong>《全角》</strong>にし、対象のセルを選択した状態で文字を入力します。</p>\n<p><strong>〈タブ⇥〉</strong>を押すと、ひとつ右のセルが選択されます。</p>",
    "image": "img_slide/ss11_06.png"
  },
  {
    "title": "2.2. 数字の入力",
    "note": "<p>入力モードを<strong>《半角》</strong>にし、対象のセルを選択した状態で数値を入力します。</p>\n<p><strong>〈リターン⏎〉</strong>を押すと、入力が確定され、ひとつ下のセルが選択されます。</p>",
    "image": "img_slide/ss11_07.png"
  },
  {
    "title": "2.3. セルの値の消去",
    "note": "<p>入力モードを<strong>《半角》</strong>にし、対象のセルを選択した状態で数値を入力します。</p>\n<p><strong>〈リターン⏎〉</strong>を押すと、入力が確定され、ひとつ下のセルが選択されます。</p>",
    "image": "img_slide/ss11_08.png"
  },
  {
    "title": "2.3. 元に戻す操作",
    "note": "<p>直前の操作を取り消すときは、次の方法で「元に戻す」操作をします。</p>",
    "image": "img_slide/ss11_09.png"
  },
  {
    "title": "2.4. 版の復元",
    "note": "<p>《版の復元》をすると、以前の状態まで戻すことができます。</p>",
    "image": "img_slide/ss11_10.png"
  },
  {
    "section": "3. 数式の入力"
  },
  {
    "title": "3.1. 数式の入力（加算）",
    "note": "<p>数式を入力するときは、〈<b>=</b>〉から続けて半角数字を入力します。<br>\n足し算をするときは、数学と同じく〈<b>+</b>〉を用います。<br>\n入力完了後、〈リターン⏎〉を押して確定すると、計算結果が表示されます。</p>",
    "image": "img_slide/ss11_12.png"
  },
  {
    "title": "3.2. 数式の入力（乗算）",
    "note": "<p>かけ算をするときは、〈<b>*</b>〉（アスタリスク）を用います。</p>",
    "image": "img_slide/ss11_13.png"
  },
  {
    "title": "3.3. 演算子と演算の順序",
    "note": "<p>四則演算をするときに用いる〈+〉や〈*〉のような記号を<strong>演算子</strong>といいます。</p>\n<p>数学での数式と同様に、四則演算の順序は次のようになります。</p>",
    "image": "img_slide/ss11_14.png"
  },
  {
    "title": "3.4. 演算の順序",
    "note": "<p>演算の順序は、数学での数式と同様に演算の順序は カッコの中，累乗，乗算・除算，加算・減算 の順に実行されます。</p>\n<p>カッコを使う場合は、小括弧「(   )」だけを使います。</p>\n<p>カッコの中にカッコを入れるときた場合（カッコの<strong>ネスト</strong>という）は、内側のカッコ内から順に演算されます。</p>",
    "image": "img_slide/ss11_15.png"
  },
  {
    "title": "3.5. 《練習》数式の入力",
    "note": "",
    "image": "img_slide/ss11_16.png"
  },
  {
    "title": "3.6. 《練習》数式の入力（解答）",
    "note": "",
    "image": "img_slide/ss11_17.png",
    "showInDetails": true
  }
]
window.slidesData = slidesData;;